tap "buo/cask-upgrade"
tap "danielgatis/imgcat"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "librespeed/tap"
tap "martido/graph"
tap "ngrok/ngrok"
tap "shivammathur/php"
brew "ack"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "unixodbc"
brew "asdf"
brew "python@3.12"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bat-extras"
brew "broot"
brew "caddy"
brew "glib"
brew "harfbuzz"
brew "chafa"
brew "cmatrix"
brew "csvkit"
brew "curl"
brew "detect-secrets"
brew "diff-so-fancy"
brew "direnv"
brew "docker", link: false
brew "docutils"
brew "duf"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "findutils"
brew "fish"
brew "fontforge"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "libevent"
brew "gnutls"
brew "go"
brew "graphviz"
brew "grc"
brew "grep"
brew "helm"
brew "htop"
brew "hyfetch"
brew "jq"
brew "libuv"
brew "jupyterlab"
brew "kubernetes-cli"
brew "unibilium"
brew "libtermkey"
brew "libvterm"
brew "lolcat"
brew "luajit"
brew "m-cli"
brew "mas"
brew "mysql"
brew "mysql-client"
brew "navi"
brew "neovim"
brew "nmap"
brew "nvm"
brew "ollama"
brew "openblas"
brew "percona-toolkit"
brew "php"
brew "pkg-config"
brew "pre-commit"
brew "procs"
brew "pyenv"
brew "rename"
brew "ripgrep"
brew "ruby", link: true
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "trufflehog"
brew "up"
brew "vim"
brew "wget"
brew "zoxide"
brew "danielgatis/imgcat/imgcat"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/krp"
brew "librespeed/tap/librespeed-cli"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "arc"
cask "beekeeper-studio"
cask "cakebrew"
cask "dbeaver-community"
cask "diffmerge"
cask "discord"
cask "docker"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "mysqlworkbench"
cask "ngrok"
cask "openinterminal"
cask "postman"
cask "termius"
cask "visual-studio-code"
cask "vlc"
mas "Color Picker", id: 1545870783
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pasteboard", id: 1499215709
mas "Pomy 2 Lite", id: 1422640635
mas "Xcode", id: 497799835
vscode "1yib.rust-bundle"
vscode "alexmunteanu.toggle-block-comments"
vscode "azemoh.one-monokai"
vscode "bmalehorn.shell-syntax"
vscode "bmalehorn.vscode-fish"
vscode "bmewburn.vscode-intelephense-client"
vscode "bodil.file-browser"
vscode "brunnerh.insert-unicode"
vscode "catppuccin.catppuccin-vsc"
vscode "chrmarti.regex"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "hubspot.hubl"
vscode "jacobdufault.fuzzy-search"
vscode "janisdd.vscode-edit-csv"
vscode "kahole.magit"
vscode "kevinkyang.auto-comment-blocks"
vscode "lakshits11.monokai-pirokai"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "saidtorres3.dark-plus-material-saidtorres3"
vscode "serayuzgur.crates"
vscode "shopify.theme-check-vscode"
vscode "sissel.shopify-liquid"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tangzx.emmylua"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "virgilsisoe.hammerspoon"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "xadillax.viml"
vscode "yy0931.gitconfig-lsp"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"
